[
{"title": "SocketScan S700, 1D Imager Barcode Scanner, Blue", "brand": "Brand: SOCKET", "rating": "4.0 out of 5 stars", "price": "$203.99", "colour": "Blue", "instock": false, "reviews": ["\n  It’s a real shame lots of retail POS providers rely on this barcode reader for their system because it’s a real pain in the butt to use.", "Less than a year after using it, battery life is almost dead, when turned on it’s still not ready to use and when you try to scan an item it sometimes emits random beeps and refuses to scan - while of course you’re in front of your customer who’s getting impatient to pay.", "It’s just so random and you’ll never be able to actually fix it.", "We completely rebooted it (total reset) a month ago and it’s slightly better but we know it’s not going to be for long.", "Also, it’s insanely expensive for something so unreliable.", "A shameful product.\n", "\n  It was great during the month that it stayed charged. $229 spent in September, and now it won’t work at all. Turns on, beeps and turns back off. Big expense for my little business.\n", "\n  We bought a second one because the first one died.  The second one had one redeeming feature:  it was bright yellow so we could find it easily.  But the battery power died quickly.  So then we bought a third one, a red heavier one that seemed to be a newer model.  But that one never worked properly; strange beeping, inconsistently well-behaved, frustrating for both staff and customers.  But support was so bad from Socket that we then went back to using the first one again while having it plugged in most of the time since at least it worked reliably (I should have sent the second one back to amazon but didn't) .. now we finally bought a third one from a different vendor, who advertised a bright blue and sent us a navy one.  And now I'm realizing that we won't need to use the socket much longer because we're switching POS systems and I am sending the darned thing back!!!\n", "\n  This is the scanner that shopify recommends for use on ipad so i was forced to purchase them.  I have now purchased 6 of these and 5 are defective.  i have wasted 6 weeks going back and forth with Socket Scan and they have no quality control program and will just tell you it works at their office.  You cannot use this product for all the inventory functions in shopify.  then the support team goes dark for days at a time.  Then you go through a ridiculous exchange program where you pay to send it back and wait weeks for the new device if you are lucky.", "The performance is terrible anyway but there were no other options for wireless scanners on shopify.  DO NOT BUY THIS SCANNER.  you will be much better off buying a cheap wireless scanner for $20 and hooking it up to a laptop and everything will work perfect.  THIS IS A NIGHTMARE that you do not want to bring upon yourself\n", "\n  I had to exchange the first because the battery started to die within minutes after only about a month of use. The second one did the same only worse. These are WAY too expensive to have that happen.\n", "\n  I have seen some of the reviews for this scanner and was hesitant to get it but it's the only one that is compatible with the Shopify POS. I am surprised at how easy it is to use and it's reliability. It certainly makes check out easy and customers are impressed at how we are able to quickly get their items scanned and checked-out. So far so good with this scanner. I will come back in a few months and provide an update.\n", "\n  The barcode scanner works well, if you have the right hardware. I hope that I could use it independently, but it requires a tablet that can access the Shopify app that I need to access my inventory. Ended up returning it, but if I had a more tech savvy team this would work great.\n", "\n  I order this for my embroidery business to track inventory. It’s a wonderful addition to my shop and pairs and works flawlessly with my iPad Pro. I have also used it with an iPad 4th generation and it worked great as well. I’m not sure what all programs you can use it with but I have used it with Shopify and square.\n", "\n  This was an incredible buy for my business. It was so natural to set up and it worked for what I need when I associated the Bluetooth. I just supplanted a long term old corded scanner with this one thus far I love it. It accommodates my hand easily and doesn't feel modest in any capacity. I have just utilized it for one day yet I am now similar to; for what reason did I stand by so long to get one? The one thing that would be pleasant however is a fitting or spread to go over the USB port for when the scanner isn't charging. I will conceivably alter this later for any issues and to refresh the battery life after I have utilized it for a month or something like that.\n", "\n  I will start by saying ‘thank-goodness for Amazon customer service!!’  I have returned two of these scanners and am waiting for a third one to arrive. Amazon has been simply amazing.", "Now, on to my review of the scanner:", "The low-battery light will start flashing regardless of state of charge.  Judging by the reviews, this has been a common problem for this particular model. I have to believe that Socket Mobile must be aware that there is a problem with some of their products. I have tried to get some info from them on how to solve this problem with the battery light constantly flashing, but their customer service is less then stellar; just giving me the run-around. I will NOT pay to ship a brand new product to them for warranty service. This is not an isolated case; they should be recalling all the defective scanners and replacing them at their own expense.", "It might be okay for ‘light-duty’ work, but if you need the scanner to hold a charge or if you wear down the battery too much, the light will start flashing and NEVER stop... even after recharging it or even after changing the batteries.", "I have owned (still do) the older model (7ci), which was an excellent product;  but the new 700-series are a disappointment. At this price-point there are numerous better alternatives.", "I am giving it a third try, but if I get the same results (which I am expecting) I will return it to Amazon and this will be the last product I buy from this company.", "Very disappointed!\n", "\n  We've been using this scanner for one month and the battery light keeps blinking. It also uses at least 2 AA batteries EVERY WEEK. We've tried multiple brands of batteries. This can't be normal so I contacted customer service to get it fixed since it's still under warranty. I was told that I can send it back but I am responsible for the cost of sending the faulty scanner back. If the scanner is indeed faulty - it should NOT be my responsibility to pay the cost to send the scanner for replacement.\n", "\n  needed a scanner for my business that works with Square app. Very easy to set up. so far working great! Now I can track my inventory:)\n", "\n  Good, but you need to charge it every day\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "Native support for Square Point of Sale - Identical to 7Ci support", "Native support for Shopify, Vend, ShopKeep, LightSpeed POS, NCR Silver, and many more", "Exceptional Ergonomics - Small, lightweight, and fits perfectly in the hand for comfortable use over extended periods", "Long Lasting Battery – Power to last over 16 hours", "User Indicators – Intuitive LEDs, beeps, and vibrations let users know battery, Bluetooth connection and scanning status"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51WWSnAcx9L._AC_SL1000_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/51WWSnAcx9L._AC_SL1000_.jpg", "path": "full/ffb71191df74b70329569bb2853ba2cfa8e9c367.jpg", "checksum": "8a030b0369bc63995e97b8900409d402", "status": "downloaded"}]},
{"title": "Desk Cell Phone Stand Holder - ToBeoneer Aluminum Desktop Solid Universal Desk Stand for All Mobile Smart Phone Tablet Huawei iPhone X 8 7 6 Plus 5 Ipad 3 4 Ipad Mini Samsung Home Office Decor (Black)", "brand": "Visit the Tobeoneer Store", "rating": "4.7 out of 5 stars", "price": "$9.99", "colour": "Black", "instock": false, "reviews": ["\n  Love this stand. It works great on my desk. My favorite part and the reason I chose this stand over others that are smilar was the place for the charging cable. You do not have to disconnect the charger to remove this phone from the stand. The design allows you to pick up the phone from the stand with the charger still plugged in. Others do not have an open top. So you have to thread the cable through a hole so it becomes a pain to pick up and put down your phone.\n", "\n  Great product. Cheap price, great quality. I bought this thinking it would be any old regular phone holder made out of thin metal. However, when I got this I was pleasantly surprised. It's strong and sturdy. Bottom grip is great and the part where it holds the phone provides grip too. The gaps in the middle and by the bottom allow you to wire a charger through; you can mount your phone and charge it at the same time without having to worry about damaging your cable! I bought the gold one and it loooks really nice as well. Very happy with my purchase\n", "\n  I bought two of these to keep on my desk at work and I love them. I have a work cell and my personal cell that I like to keep handy. The foot print is smaller than my phones laying down, so they take up less space.", "They are very sturdy construction and my phones feel very stable on them, both horizontal and vertical.", "There are 4 grippy pads on the bottom, so they don’t slide or scratch the surface they are on. They also have small silicone grippy pads where the phone sits, so the phone doesn’t slide or get roughed up by the edges of the stand. I LOVE THESE!", "I ordered the rose gold/pink ones and they are very true to color in the product photos.\n", "\n  The price seemed high for what it is. But I'm SO GLAD I overcame my hesitation and bought this extremely well made heavy duty but great high end looking phone desk stand. The matte finish and elegant curves will look great on my desk at work. The thick aluminum is no toy. Unless it's run over by a car it'll outlive me. And I especially appreciated the thin unobtrusive rubber feet that'll keep the stand from sliding if my charging cable is jostled. I expect that my coworkers will ask where they can buy one...and I'll tell them.  (& I just now bought another one for home!)\n", "\n  I am very happy with this iPhone holder. I had ordered one from a different company and it was way too large to sit on my desk, even though it was for a cell phone. This one has a smaller footprint and is heavy enough to hold the phone without falling over. While you cannot angle the screen like some of the others, it is really not necessary for a phone. This keeps my phone where I can find it easily and you can run the power cord through it as well. I almost did not see the little package inside the box that comes with the rubber pads to keep the phone from getting scratched.  The only thing I don’t understand is why each rubber pad was a different size. Btw, I  only saw them when I was about to return the item because I was afraid of scratching my phone… When I opened the box to return it, the little package fell out. Great product for a great price.\n", "\n  Very happy with this product.  I purchased this product to hold my phone vertically so I can read books in my phone.  It is perfect for when you want to read or look at photos or scroll on Instagram.  I would not use for Selfies as it would not be a flattering angle, you would be looking down in the photos.  For selfies I prefer my phone to be up much higher.  I also love the Rose Gold color, as it matches perfectly with my other Rose Gold office accessories (see photo).  I would give 5 stars, as it is perfect for my purposes -- but I felt I had to leave off one star in case someone is intending to use it for selfies (Note:  I was not intending to use this product for selfies anyway, so for me it's really a 5 star product).\n", "\n  I have a Note 8 and can't use this with phone vertically with the case on while charging, which is the whole reason I got it. My case already allows me to stand my phone horizontally, which is the only way I can use this stand while charging my phone in it's case. The ledge and where the cord slot stops is too shallow to stand the phone vertically with the case on because the case adds just enough depth that the charger plug is too far forward to allow the phone to sit on the ledge without falling forward. Since most people use a case, and as far as I know all plugs are on the bottom of the phone, this stand is pretty much useless if you don't want to keep taking your phone in and out of the case to use the stand while charging vertically. I would imagine the same problem would exist for thicker phones or chargers with a thicker end where it plugs into the phone, because without the case it literally is the exact measurement to fit.\n", "\n  The stand is so small so if you try to have it plugged in to charge there is no room for the cord. It is pretty much useless. I have ordered another brand that allows for room for the charger plug and wire. I like to have my phone charging in my office while I'm working, not just sitting there. It shows that there is room for the cord and plug going into the phone but in reality the stand is so small and I have a small iPhone 6, there is still no room for the plug and cord.\n", "\n  This product is good and handles the weight of the phone really well.  You can charge ur phone while its in the stand also.\n", "\n  ~ It does the job & is sturdy!♥\n"], "description": ["📱UPDATED SOLID / EXQUISITE WORKMANSHIP: 4mm thickness aluminum, which is thicker than normal phone stand (2/3mm), smooth edge, simple, lightweight, perfectly works with your smart phones", "📱COMPATIBILITY: The cell phone desk stand, compatible with iPhone / Android phones in 4/8 inches, such as iPhone 6 6S 7 8 X Plus, HUAWEI, Galaxy S7 S6 S8, Note 6 5, LG, Sony, Nexus, although with a case", "📱STURDY / SILICONE RUBBER PROTECTED: Phone stand, designed on a low center of gravity makes it stable, and silicone rubber cushions of hooks, bottom protect the phone from scratches and sliding", "📱TOBEONEER ADVANTAGES: Suitable height, perfect angle of view when using Facetime YouTube, easy to read message, Facebook, emails, cooks from a recipe online", "📱WHAT YOU GET: 1 x ToBeoneer Cell Phone Desk stand / Lifetime NO-Hassle refund Guarantee. If you are not satisfied with the cell phone desk stand, offer you a full refund or a brand new replacement."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61wOlkdOTJL._AC_SL1001_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61wOlkdOTJL._AC_SL1001_.jpg", "path": "full/94b2605c4e430407aa029a49d39b657748ddabc2.jpg", "checksum": "9492ca36ac0f9e85d36e2908f1cd5217", "status": "downloaded"}]},
{"title": "Cell Phone Stand,Angle Height Adjustable LISEN Cell Phone Stand for Desk,Thick Case Friendly Phone Holder Stand for Desk, Compatible with All Mobile Phones-White", "brand": "Brand: LISEN", "rating": "4.5 out of 5 stars", "price": "$14.99", "colour": "White", "instock": false, "reviews": ["\n  I was going to buy a shorter silver stand for my phone that was much more popular than this one. I found this one shortly after and I’m glad i did. You can adjust this stand shorter or taller and adjust it more upward or forward. It also has a place at the bottom where i can put my AirPods on.  The only complaint i would have is when i FaceTime from my desk it leaves an awkward position for me because of the limit on adjustments. I don’t really FaceTime so for me thats minimal and i still think its worth a buy for my work desk.\n", "\n  I was so tired of losing my phone behind ingredients, pots and pans while trying to cook from online recipes. I purchased this weighted-bottom stand to avoid that. I am now able to keep all kinds of cooking debris away from my ports and smears off my screen too. This stand can hold my iPhone and iPad for that reason and even charge during.\n", "\n  UPDATED January 23rd, 2020: I received a replacement stand today and I love it!!! It’s adjustable vertical and horizontal as well as swivels 360 degrees. I love the fact that there is a loop in the back for your charger to go through. I have an iPhone 8 Plus. I have not yet try my tablet on this but I’m sure it won’t be a problem. The stand is stable and sturdy. I have room at the bottom for my Apple Watch stand & and iPods and charger. I would definitely recommend this stand.", " Received stand and just now open it to put it together; it is very dusty and it did not come in the plastic wrapping and the box didn’t have a seal. The stand looks used! It will not adjust up and down as stated. I will be returning it in the morning.\n", "\n  I needed a stand where I could comfortably use my phone and not worry about falling over where I found this one with a lot of good reviews. This one is rock solid, very easy to put together by one screw and adjusts perfectly to any angle.  Base is thick and has weight to where my phone never falls over, even at any angle that I could find. No cons, could not find any flaws to where I am very happy with the purchase.\n", "\n  I think for the price, this is a good value.", "The delivery was quick but the unit is delivered in its original box vs contained in an Amazon box.  There was no tape so the box flap had come undone and the product could have emptied out.  As this is an Amazon delivery (\"Items shipped from Amazon.com\"), that's their problem and not the company.  I sent those comments to Amazon.", "Out of the box it was an easy assembly with only one screw.  I see in the ad that they mention some parts made of metal.  The main part of the telescoping pole is metal and, hard to tell, but the base is too.  There are lots of plastic pieces and parts too to include the main part which holds the phone and the hinge with loop in the back.  I saw the one pic/review with the broken plastic connection.  If I were to choose a part to be metal, it would have been the moving parts--the hinge.  No concerns at the moment that this will hold together but only time will tell.", "I like the wide base, as advertised.  As I play with trying to tip it over, it appears quite resistant.  I also like the ring in the back to keep the cord out of the way when plugged in.  I also like that the pad the phone rests on is non-skid silicone and it covers the whole surface.  Lots there to prevent the phone from sliding off.  However, the feet on the base are different material and don't appear to be skid-proof.  Oh well.", "I do wish the telescope was a little more--taller.  I'm still looking down at full extension.  However, as advertised, it telescopes 1.4\".  The hinge in the back works fine and there is no need to tighten it to change the angle the phone is at.  I see the comments from other owners that it doesn't hold.  It appears to be friction so maybe there is concern that it loosens over time.  Let's hope not.", "I'd buy this one again.", "*** Update (12 Sep) - no issues.  Hasn't broken (ref other reviews).  Although I've been very very careful to not pick it up from the top and only from the base.  The joint is still strong and offers secure positioning.  I like that the base has a lip and I've been using it to store small things securely (like SD cards).\n", "\n  *2020-06-15 Update*", "Seller provided me with a new revised model that appears to have corrected issues with previous model, new model feels a lot more sturdy. Updating review accordingly and am VERY happy that the seller listened to input on the flaws of their product and so quickly had a revised version available.", "*2020-05-21 Update*", "Been in talks with seller, they are working with manufacturer to make a better model available, and they said they'll send me an updated one in a few weeks. Will update review if/when I receive it.", "*Original", "Broke second day of using it, the base and poll are good quality, but the plastic piece that tray is connected to is a horrible design.\n", "\n  I really like this product. It works great for watching movies and/or reading recipes. I like the design because it allows you to charge the phone worry free of cramping the cord.  I was going to buy one produced by another brand for twice the cost. I'm glad that I opted to buy this one instead.\n", "\n  Being that I have started using Zoom and other video conferencing apps so frequently these days, I got tired of trying to prop my phone up on books or boxes or whatever. This handy little device stand doesn't look like much but it gets the job done. When I'm not working, I use it to watch movies in bed", "Contrary to what the description says, it fits my iPhone 8 while inside it's Otterbox case just fine. No problem here!", "The box/description seems to indicate that the device stand is bigger than it is. But it works fine.\n", "\n  I ordered this for my Grandma so she doesn’t look down at the table when she’s on her phone. It helped instantly.", "It was easy to assemble and is quite sturdy. The biggest surprise is that it holds my ipad air in an otterbox case; while extended to the highest height. I was worried about an otterbox case being too bulky, but it fits perfectly. See photos for more details.", "Pros:", "- Sturdy and Strong, holds an ipad air with an otterbox case while stand is extended.", "- Good base weight, could be a little heavier, but it’s fine.", "- Non-Slip Bottom", "- Easy angle adjustment", "- Easy assembly", "- Good packaging", "Cons:", "- Doesn’t extend as much as I expected. It only extends 1.5 inches. Overall stand is 4 inches and extended is 5.5 inches. It’s just below eye level, so it works for our use, I just expected it to extend more than 1.5”", "- No system to extending it. You just pull up or push down to extend. Would’ve liked to see some kind of mechanism to lock the position in place, but it does hold it’s extended position with my ipad air in an otterbox case.", "- A little unsteady if you’re playing a game that requires a lot of screen touching. If you’re reading the news or watching something you’ll be fine. My Grandma uses it for Word Cookies and it works perfectly.", "Also, as mentioned in the description, it can be unsteady with bigger items with the stand extended. Just be careful with how strong you are touching the screen.", "Overall, I’m very impressed with the stand and would recommend it.\n", "\n  There is nothing to dislike about this stand! I wish that I had bought this stand a long time ago. The price was reasonable and the stand is practical and meets my needs. I have got my money’s worth! Thank you to the inventor and the company which has made it available!\n", "\n  I like the design of the stand, the loop for wire at the back is very convenient when I need to carry, or pull up the height of the stand. The base of the unit can also be used as a small tray for  my keys. Moreover, the adjustable height is prefect for viewing. I am using the stand for my cell phone and tablet, and I don’t have to hold the device in my hand. Lastly, I am impressed by the stability of the stand, especially when I use it for my tablet. Its construction is robust. The thoughtful design, reliable quality, and good price make this cell phone stand a great find!\n", "\n  One of my favourite items I ordered. I own a ipad and the bottom is sturdy enough to hold my ipad and i sometimes use it for my phone. Its perfect height already bu can be extended abit if needed to. Material is very good. I recommend getting this if you need a stand to hold. I use it to watch netflix!\n", "\n  I wanted a stand so I could watch Tik Toks and play on my phone while I'm eating my breakfast in the morning, and this has more than fulfilled its duty! I love it! My phone fits just fine with the case on and it's super sturdy! Love the height I can get it at, and that I can pivot it to a good viewing angle. I even tested my over 10'' tablet in it, and it was still sturdy and holding it fine (also with the case on). Very happy with my purchase.\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "WEIGHTED ANTI-SLIP BASE: This cell phone stand for desk is equipped with a weighted base, and an aluminum alloy rod that makes a lower centre of gravity. Therefore, this cell phone stand is stable enough to support all smartphones, such as iPhone 11/11 Pro/Max/X/MAX/XR/8/8P, Samsung S10/S9/S8, LG, Sony, Nexus, etc.(NOTE: IT MIGHT NOT SUITABLE FOR DEVICES OVER 10 INCH)", "HEIGHT&ANGLE ADJUSTABLE: This cell phone stand holder is in accordance with ergonomic design. The height can be easily adjusted between 7.1in-8.5in(1.4in adjustable range), the angle is adjustable between 5°~85°, providing you comfortable viewing angle which helps to fix your posture and reduce neck & back strain.(Tips: for big size devices, PLEASE LOWER THE HEIGHT AND ADJUST A SUITABLE ANGLE TO GET BETTER STABILITY.)", "ANTI-SLIP DESIGN: The pad back and the bottom of this cell phone stand are fully covered by anti-skid silicone, which can provide maximum protection for your device from any scratches and slide.", "USER-FRIENDLY DESIGN: There is a reserved charging hole convenient for you to charge your devices while using this stand. The circle design of cable organizer supports the cable management, no tangling worries. This phone pad will not cover the subtitle when you watch video. LISEN always aims at providing our customers a happy experience.", "❤️WE CARE ABOUT YOU❤️: This item comes with a 100% satisfied worry-free Customer Service. If the product arrives broken, or get broken within 365 days, please directly contact seller NiceTop for free replacement. Any other problem like missing installation units, please contact us for satisfied solution, we'll try our best to provide our customers with the most sincere service! (Product including: phone stand*1, screw*1, hexagon screwdriver*1, specification*1)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zL3v-gNAL._AC_SL1400_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61zL3v-gNAL._AC_SL1400_.jpg", "path": "full/41784d0d53f07dbc982d49c3b4fdf4587d4e9065.jpg", "checksum": "011991dd98c1a67b7bc79d2ced31af30", "status": "downloaded"}]},
{"title": "weBoost Drive Sleek (470135) Vehicle Cell Phone Signal Booster with Cradle Mount | Car, Truck, Van, or SUV | U.S. Company | U.S. Carriers - Verizon, AT&T, T-Mobile, Sprint & More | FCC Approved", "brand": "Visit the weBoost Store", "rating": "3.8 out of 5 stars", "price": "$199.99", "colour": "not defined", "instock": false, "reviews": ["\n  As a frequent user of Wilson electronics portable cell phone booster, I used their boosting product for field work in area where there are routinely very poor cell phone reception. I have used it on my car, rental car and even rental truck. In fact for 7 years i had bought two Wilson Electronics 460106 Sleek - Vehicle Cellular Signal Booster for use with Verizon phone. Needless to say, they had worked well for me.", "As I have changed phone service to AT&T, I bought the new portable Weboost 470135. The product is sleek and professionally built with easy to follow and setup instructions. It does come with a lot of handy accessories for mounting the phone holder. Per my uploaded pictures, the portable cell phone booster did help to boost up both the voice signal as well as data speed marginally.", "Depending on your cell phone tower locations, please don't expect miracle to your voice and data. It is only a marginally improvement. The cell phone booster used to cost 3 times less for the same function. Perhaps, the cost of sub-contract manufacturing or advertising has increased. Anyway, Weboost Drive Sleek 470135 did work for me on AT&T but with marginal improvement to voice and data. As such, I would only recommend it if you need it as a cheaper alternative to other more pricey model. Depending on your needs and if you need more quality signal boost than 1 bar, I recommend getting the other more expensive models from Wilson or (even other make). That usually cost much more in my view.\n", "\n  I have to say that I am completely dissatisfied with this product!  This is the second one I purchased.  The first unit went up in smoke, literally, the very first time I powered it up.  The second one did not perform at all.  It didn't increase my signal when it was low and made absolutely no difference in reception whatsoever when I had two or three bars.  Too bad for all concerned.\n", "\n  We drove from Tx through New Mexico into the Colorado mountains. We lost signal in 6 areas on the way to our remote cabin. But using the WeBoost all the way home, we NEVER lost signal & 2 others were using my phone as a hotspot for wifi !  While at the remote cabin, we were told by the owners we wouldn't have data or cell signal.  Sure enough, nothing! So I setup the WeBoost in the upstairs bedroom putting the magnetic antenna out the window. We had 4G 2-3bar signal AND we even streamed Dish TV shows!!\n", "\n  I had an older version of this that seemed to work somewhat so bought this new version to use.  After using it a couple months it didn’t really seem to help at all so I went to different spots where I have minimal service and set my phone to the field test to see the actual strength of the signal and with or without the booster the signal strength was the same.  It had ZERO effect on it.  ZERO effect on calls or data or anything.  It does turn on the little white light, which is extremely annoying while driving at night btw, but that was the only thing they claim that it does that it actually did.\n", "\n  Well I got this product originally back in early April I believe. It worked for a couple months and quit. Customer service was great and I got a replacement right away. Well the replacement was in for a couple months and has quit again. I followed all directions. This is a very expensive product for it to only last a couple months. Not very happy.\n", "\n  I have owned the Drive Sleek for almost a year and have genuinely pleased with its ability to boost very low signal. In general, I get about double the range from a tower as I would without the booster. That said, because I live in southern West Virginia and cell towers are very few and very far between, there are still many areas where even this booster is not powerful enough. So I do have some regrets getting the Drive Sleek over its more powerful cousins, the Drive 4G-M and Drive 4G-X. If you only need a booster to cover the occasional deadzones, this would be a great choice. However, if you are like me and live in an area with you only have pockets of cellular signal and almost no signal everywhere else, I would recommend going with one of weBoost's more powerful boosters.\n", "\n  I use this in the mountains in Southern California last weekend. I was driving through dips and hills in a known area for dropped calls. I called a friend and started a conversation without the booster. Yes the calls were dropping and annoying. I installed the booster and continued on the same terrain and started another call. I did not drop the call again and drove through the hilly section for another 20 minutes until out and into a good cell area. It did work great there. We then went to our campground where there was only 1 bar of service in and out. I was disappointed that the booster did not bring that marginal 1 bar in but we were in trees. If we drove out of the trees it would work again. I am pleased that it does work when when not obstructed too much. I would recommend this product for long highway trips but don't expect it to work miracles if obstructed to heavily.\n", "\n  The biggest issue with signal boosters is they have to use the same frequency coming in as going out. This creates the potential for a feedback look that shuts the device down.  Wilson not being stupid and having a lot of experience has gotten around this with a VERY short reception area for the cell phone.  For optimum results the phone HAS to be in the cradle and the system works quite well as long as there is a tower for your carrier within reach.  Having an understanding of how cell phones work and the what it takes to boost a signal is quite helpful in obtaining optimum results.\n", "\n  Producto muuuy prometedor pero la realidad es que deja mucho que desear. Lo estuve monitoreando durante 1 semana, a lo mucho en áreas donde existe cobertura aún llegaba a bajar la señal, revise y solo aumentó en tiempo real de 8 a 10 db, para el costo no vale la pena, aún así hubo dos ocaciones que se cortó la llamada. Un bonito sujetador para tu teléfono si es lo que quieres.\n"], "description": ["STRONGER CELL SIGNAL — The weBoost Drive Sleek ensures fewer dropped calls, better voice quality, faster mobile internet, and improved improved streaming on the road for a single mobile device in a cradle mount", "CARRIER COMPATIBILITY — Allows drivers to enjoy stronger cell signal from all U.S. networks and carriers including Verizon, AT&T, Sprint, T-Mobile, U.S. Cellular and more", "5G READY — weBoost products will continue to enhance cell signal coverage for the next decade and beyond", "CHARGES PHONES — Features a rapid charging USB-A cord for charging your mobile device on the go", "SINGLE-USER BOOSTING CRADLE — Adjustable design easily fits any phone or hotspot between 5.1” and 7.5” in length", "FCC APPROVED — Meets all FCC guidelines and won’t interrupt or harm any carriers’ signals to and from the cell tower", "SATISFACTION GUARANTEED — Backed by a 2-year manufacturer’s warranty and a 30-day money-back guarantee by weBoost", "PROUDLY AMERICAN — The only booster designed, assembled, and tested in the USA: Our products are not manufactured in China", "TOOL-FREE INSTALLATION — Includes a user-friendly guide to help ensure quick, easy, and hassle-free setup in any type of car, truck, van, or SUV", "WHAT’S INCLUDED — Drive Sleek Booster, Drive Sleek Cradle, Drive Magnetic Outside Antenna, Power Supply, Magnetic Vent Clip, Dash Cradle Mount and Installation guide"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81vVCaEUmjL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81vVCaEUmjL._AC_SL1500_.jpg", "path": "full/8fbabb090245b243ec539597482af74a81b76928.jpg", "checksum": "cc5881dc324f2adf2b29e30697c01a5b", "status": "downloaded"}]},
{"title": "DJI Osmo Mobile 3 Combo - 3-Axis Smartphone Gimbal Handheld Stabilizer Vlog Youtuber Live Video for iPhone Android", "brand": "Visit the DJI Store", "rating": "4.6 out of 5 stars", "price": "$119.00", "colour": "not defined", "instock": false, "reviews": ["\n  I normally wait about 6 months to write reviews, but I’ve had this thing out of the box for about two hours and I HATE it. The thing I hate the most is that IT COMES WITH ZERO INSTRUCTIONS. You are completely on your own. What moron thought this would be a good idea? I’ve downloaded the app, I’ve watched two videos on YouTube and neither I nor my 14 year old son can figure it out. It’s not like using a gimbal for the first time is intuitive.", "I’m sure it’s a good gimbal. The reviews are fantastic and DJI puts out quality stuff. If I can figure it out, use it and find it helpful for my vlog, I’ll come back and alter my review. But for now, I’m totally pissed. Not intuitive. Not user friendly. No instructions. How hard would it be to write a page in English explaining how to set up your product? Buying a new toy shouldn’t piss you off.", "One star.\n", "\n  I tried two other gimbals before this one. First one didn't work with my iphone 11 max so back it went. The second one had so many controls I thought of calling NASA! I got this OSMO mobil 3 and love it! It was easy to connect. Only a few buttons but it packs a punch. The folding feature is great. It fits nicely in your hand. The app works very well. I love that all your files are saved to your phone, not the app like the last gimbal. It was easy to download a full size operations manual. Plenty of youtube videos to walk you through the settings. This thing rocks!\n", "\n  This gimbal by DJI in particular is one of the best. I did quite a bit of research and I don't want to return but I have to. My only problem is that it is not compatible with my new phone I recently got. (Samsung Galaxy S20 Ultra). After purchasing I could not get the gimbal to balance correctly and I got in touch with DJI and a rep. told me it is not compatible with the new S20 line of phones.\n", "\n  I purchased this upon the \"predicted\" recommendation of a friend who had the Osmo 2.  He said the 3 was going to be vastly improved, and was reconfigured to allow for use with external microphones, which is absolutely necessary for what I record.", "To begin, there is the crudest most usless \"Startup\" use card in the box.  You will have to go onto the internet and watch videos from other people and companies to figure this device out.", "Be forewarned:  This device work ONLY inside of the MIMO app.  So if you record a video, it WILL NOT be stored on your phone... it is in their app in the cloud.  Then you have to \"EDIT\" the video to get it save onto your phone.  Even then, it will be hard to find.", "I tried calling customer support.  It is run by Asians that barely speak English.  They cannot answer the most rudimentary questions. Every question results in a 10 minute hold followed by a failure to answer your question.", "After a lot of protracted pain in trying to figure this device out, it seemed my external bluetooth wireless mic did not work on my Android, Samsung Galaxy S9.  The internal mic worked, but it did not recognize my wireless mic was connected to my phone.", "Another 50 minutes on the phone with people telling me that it's my phone's fault.  Idiots.", "I searched the internet and found witihout the help of the manufacturer, that the DJI OSMO Mobile 3 cannot support wireless mics on Android devices!!!  2 Weeks of wasted time.", "Sending device back.  Terrible... terrible... terrible support.\n", "\n  As an amateur videographer, the Osmo Mobile 3 is awesome. Its incredibly light weight, compact size, excellent face tracking, great battery life with an affordable price. It brings a stability and composition to my personal videos that I could never get with a hand-held video. I recommend this phone gimbal.\n", "\n  I just returned my DJI Osmo Mobile 3 because I could not get it to work. Both the usability and the documentation of the device appear to be very poor. I might have eventually gotten it to work, but I had so many difficulties that I do not trust I could rely on this device in the field. I will keep looking for a gimbal that is easy to use and reliable. One of the specific issues I had was that I never got past the blinking green light, despite the fact that I balanced my phone on the device. The documentation seemed to say that if I held down the power button, there would be a beep and the green light would become solid. But when I held down the power button, the device just turned off. I had other issues as well, especially with a lack of documentation.\n", "\n  Bought two OSMO 3 for a very important event this weekend having used earlier units with success. Totally worthless. Video crashes after 2 min and doesn't save. Pano shots are blurry. Literally worthless. The hardware itself may be fine, but the software/app required to operate it with an android is terrible. Read the Google play reviews, I wish I had before purchasing these.", "DJI, how could you even release this product with all of these issues? Hard to even call them 'issues' when the entire function and purpose of the device is unusable. I just lost a lot of money on a paid video gig and you lost a customer for life.\n", "\n   Hands down an awesome tool. Say good bye to jittery videos. Say hello to ultra smooth, fun, and exciting videos. I originally ordered from DJI website but after a week of my gimbal not arriving I emailed the company. They said my product would arrive in a month.", "It’s not early 2000’s anymore. So I canceled my order and took a chance on amazon. Seller did not disappoint. Same day delivery! Deserves every star available.", "Pros:", "-super smooth", "-simple to operate,", "-people reported issues with the app, but I’ve had nothing but a great experience.", "-fun video creator with effects and no editing.", "-comes with a case, Tri pod, and wrist band.", "Cons", "- would have liked it in a nice matte black", "- takes a bit to balance out if using a lens. (I used sandmarc wide angle and anamorphic with screw on case. I haven’t tried using counter weights.", "- Case is super tight and gimbal only fits in one way. And because gimbal twists in many ways when you fold it, you have to remember which way works.", "This gimbal is so much fun and can be used almost right away. (A good charge is recommended.)\n", "\n   実際に手にしてから必ず外出先で持ち運ぶようになりました。", "これ無しではもう出かけられません。", "《良いところ》", "①手ブレが少なくなって綺麗に撮れる", "少し駆け足してもちゃんと被写体を捉えてくれます。", "②広い範囲で撮影することができる", " 特にパノラマ撮影機能は、縦横にそれぞれ9箇所に撮影して繋げる機能で、従来のiphoneのワンショットより3倍の広さで撮影することができるので、集合写真に大助かり！", "（添付の1枚目に比較あります）", "③電池の持ちがいい", "スマフォと同じくらいの2000mah以上のバッテリー内蔵で、単体で15時間ほど稼働。", "撮影中に携帯電話の電池が無くなってもすぐに繋げて充電ができます。", "④コンパクトで軽い", "折りたたむとサコッシュに入ってしまうくらい小さくなり、しかもタイムプラスなど長時間撮影していても辛くないです。", "⑤専用のDJIのアプリがすごい", "スローモーションや画質、明るさ設定など", "「あれ？iphoneってこんなに綺麗に撮れるの？」と驚くくらい性能を惹き出してくれます。", "また編集に詳しくなくても、複数にあるテンプレでカッコいい映像を自動的に造ってくれる「STORY」機能があるので、", "どんな方でも素敵な思い出を簡単に残せます。", "⑥安い", "こんだけ機能が豊富で、まだ応用に活かせそうなのに、1万円ちょっとで買えてしまう良心的な価格にびっくり。", "広角とブレ機能を持つアクションカメラと買うか迷っていたのですが、こちらで満足です。", "《気になるところ》", "①慣れが必要", "起動、同期、カメラの操作等、ある程度練習が必要で、自分はYouTuberさんのレビューや説明を何度も見て練習しました。", "②iphoneだからこそ？", "androidのアプリにも対応していますが、", "機種の性能によっては機能の制限があるので、あくまでもiphoneでの撮影を考えた方がいいです。", "③それ以外には使えるのか疑問", "上記のようにDJIのアプリと連携することによって、様々なスポーツシーンや顔認証して追跡する機能が使えるのですが、逆にこのアプリがなければ、ただのスタビライザーになってしまいます。", "例えばアクションカメラや普通のカメラをつけたとしても、機能を発揮できないと思います。あくまでも スマフォ専用です。", "《コンボセットと通常の違い》", "コンボセットには、布製のハードケースと、三脚が付いてます。", "ハードケースはスーツケースやリュックサックにたくさん荷物を入れて持ち運ぶ際に、", "ジンバルを裸のまま入れると怖いので、", "安全に運びたい方には必須です。", "また三脚は自撮り用というよりは", "ハンドの延長用として長く持って使う、", "ジンバルをそのまま床に置くとモーターが振動してぶっ壊れそうになるため、安全に置いておく用のスタンドとなります。", "長く大事に使いたい方はコンボセットを推奨します。", "上記の使用シーンを踏まえて、", "追加料金を払うかどうか考えた方がいいです。", "《まとめ》", "・iphoneユーザーなら買ってもおつりでるくらい素晴らしい映像進化ができる！", "・androidユーザーはアプリを入れた状態で、店舗に行って実際に同期させ、", "どんな機能が使えるか事前に確認が必須", "・カメラ、アクションカメラをつけて使用を考えている人。DJIアプリを搭載できるスマフォ用なので、あまり機能を発揮できない。\n", "\n   DJI : une marque qui s’est déjà clairement fait un nom dans le domaine du loisir avec entre autre une gamme très vaste de drones (Mavic Air, Mavic Pro, Spark, Phantom, …) et aussi tout le une gamme de stabilisateurs (Osmo Mobile, Osmo Pocket, …).", "Pour le stabilisateur Osmo Mobile dont il est question ici, on est déjà à la troisième génération. DJI a bien fait évoluer son produit, et en plus le prix baisse :", "la version 2 était vendue à 149 euro, la version 3 ici est venue à 109 euros en « version de base » et 129 euro en « version combo » (version que je conseille vraiment par rapport à la version de base car pour seulement 20 euros de plus, on profite en plus d’une mallette de transport et d’un trépied). C’est rare d’avoir des prix qui baissent tout en ayant des performances en hausse, la concurrence profite plutôt souvent du passage d’une génération n à la génération n+1 pour augmenter ses tarifs.", "➡️ Les améliorations par rapport à la version 2 :", "-Une mallette de transport bien plus petite (au moins 2 fois plus petite). C’est bien plus pratique, et c’est grâce au pied pliant. Ça reste quand même difficile de le mettre dans une poche mais ça reste possible avec une grande poche.", "-Le port usb permet de recharger son téléphone pendant qu’on filme. Il est bien placé et le câble usb ne cogne pas contre le support lors des mouvements.", "-En deux clics sur le bouton M, on passe du mode portrait au mode paysage sans avoir besoin de débrancher le téléphone ou arrêter de filmer.", "-Activ Track 3.0 : grâce à cette fonction, la caméra suit automatiquement une personne. On peut aussi faire des Time Lapse très simplement. Ça permet de faire des vidéos de très bonne qualité. DJI maitrise son sujet, la partie matérielle et la partie logicielle sont très bonnes.", "➡️ Des points à améliorer?", "Franchement pour cette gamme de prix, c’est vraiment excellent.", "Je conseille la version combo pour seulement 20 euro d’écart mais un point reste à améliorer : le trépied fourni ne rentre pas dans la mallette de transport mais il se glisse sur le côté et dépasse donc un peu. J’ai du mal à comprendre ce choix, même s’il ne remet pas en cause les performances de ce stabilisateur.", "➖➖➖➖➖ EN CONCLUSION ➖➖➖➖", "👍 Cette version 3 est franchement mieux que la 2 qui était déjà une référence :", "Plus légère, plus compacte, plus performante et malgré tout moins chère. Je ne peux que vous recommander cet achat.", "Pour moi, c’est le meilleur stabilisateur sur le marché, en tout cas dans cette gamme de prix.", "✅ En espérant vous avoir été utile.\n", "\n  This is a smooth gimbal that works well with large/heavy phones (mine is a Samsung Note). All the controls are well positioned, but it does not come with any documentation; you need to find and download the manual to learn what multiple presses of the buttons and trigger do.", "You also need to download and install the DJI Mimo application on your phone. As of 10-Oct-2019 there is a bug that may cause this to freeze on Android phones the first time you use it, when it runs through its 'What the buttons do' tutorial. Set your font size to SMALL before you first run the app. After the one-time 'buttons tutorial' has finished, you can reset your font size back to your preferred setting. DJI are aware of this and promise it will soon be cured.", "The Bluetooth connection is made through the DJI Mimo app, not the normal Android pairing method.", "Some complain of jerky video when doing a slow horizontal pan: That is caused by your phones image stabilisation not this device. Turn off the phones image stabilisation before filming a slow pan shot.", "Its battery life is very good.", "The combo version comes with a tripod plus hard and soft cases. There is no room in the hard case for the tripod.", "After using it extensively for 2-weeks I'm impressed with the results. So despite lacking printed documentation and the minor (but easily to avoid) glitch during the software 'tutorial' I am very pleased with it. Find and download the manual whilst you are waiting for it to be delivered.\n", "\n  DJI ,I have only one question... where should I put tripod stand ??? No room in this case!?\n", "\n  Provengo da OSMO Mobile prima versione, per cui vi descrivo questo nuovo Osmo Mobile 3 rapportandolo a quello.", "La primissima cosa che si nota è l'estrema compattezza dell'OSMO 3 da ripiegato: in un sacchetto entra il device più il treppiede, il precedente (come d'altronde l'Osmo Mobile 2), non sono ripiegabili e sono piuttosto scomodi da riporre, con i giunti sempre oscillanti e traballanti. Ottimo miglioramento.", "La confezione della versione Combo include un piccolo treppiedi ed una custodia rigida oltre al contenuto del kit base: a mio avviso è un po' scarna oltre che da l'impressione di essere stata organizzata in maniera frettolosa: nella custodia rigida c'entra l'osmo e basta, il treppiedi no! Piuttosto nel sacchettino a corredo del kit base c'entra Osmo e treppiedi. Risultato: la custodia rigida l'ho messa da parte e vado in giro col sacchetto!", "Treppiedi compatto, ma senza infamia né lode. Niente a che vedere col Manfrotto Pixie (giro link) che costa quanto la differenza tra la versione liscia e la combo dell'Osmo 3:", "https://www.amazon.it/Manfrotto-MTPIXI-B-Treppiede-Fotocamere-Impugnatura/dp/B00D76RNLS/ref=sr_1_1?__mk_it_IT=%C3%85M%C3%85%C5%BD%C3%95%C3%91&crid=3NCLDBEKS7CHQ&keywords=pixie+manfrotto&qid=1568725513&sprefix=pixie+ma%2Caps%2C160&sr=8-1", "Primo difetto che riscontro nell'Osmo 3: è difficilissimo da utilizzare con la mano sinistra! Mancini (come me) siete avvisati: a causa della disposizione non simmetrica dei giunti sarete costretti ad utilizzare la destra per tenere il gimbal, per cui c'è da abituarsi un po': sia chiaro è anche possibile maneggiarlo con la sinistra, ma ad esempio non potrete fare riprese rasoterra o rotazioni a 90 gradi.. insomma, preferirete usare la destra dopo un po' di prove.", "La cosa buona però del nuovo Osmo è che il primo giunto non si trova immediatamente dietro allo smartphone una volta montato, per cui è piuttosto lontano dalla fotocamera e quindi anche ottiche wide (non esagerate), non fanno vedere il gimbal durante le riprese.", "Altra cosa comoda la filettatura sul fondo (il mio Osmo l'aveva di lato... inutile!): ci si possono avvitare accessori come bastoni prolunga ganci o treppiedi standard per fotografia.", "I motori sono molto più potenti del mio Osmo Mobile1.. il Samsung S9+ viene mosso che è una bellezza! Col precedente non potevo fare scatti repentini altrimenti i motori andavano in fault.", "Il sistema di tracking è molto superiore al precedente! Gli oggetti anche veloci vengono seguiti dal gimbal senza intoppi.", "Altro difetto oramai sbandierato ovunque è la non completa compatibilità con i dispositivi Android: al momento della recensione l'applicazione DJI Mimo che serve a gestire il gimbal non consente riprese con framerate superiori a 30fps (quindi no slowmotion) e soprattutto (almeno per me) non consente Hyperlapse a risoluzione a 1080p. Con l'applicazione fotocamera del cellulare invece non funzionano i tasti di registrazione e zoom.", "Tutto ok invece con l'iPhone XR di mia moglie, DJI Mimo con risoluzioni e fps sbloccati e funzioni complete anche sull'App Fotocamera.", "In definitiva, nonostante i difetti credo sia al momento il miglior gimbal per smartphone in commercio: chiaramente non posso mettere 5 stelle per le evidenti lacune software soprattutto per gli utenti Android: per la versione consiglio la combo solo per il treppiede, che comunque è necessario se volete fare Motionlapse (il gimbal non ha il fondo piatto per cui non più essere poggiato senza treppiedi), altrimenti acquistate la versione liscia e risparmiate ste venti euro.\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "Featuring a new foldable design, a lots of new functions the Osmo Mobile 3 smartphone stabilizer is a must-have handheld gimbal for content creators.", "A 3-axis stabilized gimbal features brushless motors that provide smooth, real-time responses to eliminate unwanted camera movements.", "The Osmo Mobile 3 features a variety of functions allowing you to vlog and shoot content throughout the day including: Gesture Control, Dolly Zoom, Panoramas, Slow Motion, Timelapse, Hyperlapse, Sport Mode, Handy Convenience, Story Mode.", "Compatible Phones: Weight: 7 +/- 1oz; Thickness: ≤ 0.37\"; Width: 2.44\"-3.46\"", "DJI Mimo App requires iOS 10.0, Android 7.0 or above. Compatible devices include: iPhone 11 Pro Max, 11 Pro, 11, XS Max, XS, XR, X, 8 Plus, 8, 7 Plus, 7, 6s Plus, 6s, 6 Plus, 6, SE, Samsung Galaxy S10+, S10, S9+, S9 , S9+, S9, S8+, S7, S7 Edge, S6, S6 Edge, Note 8, Huawei P30 Pro, P30, P20, P10, Mate 10 Pro, Mate 10, Mate 9 Pro, Mate 9, Honor 10, Honor 9, Vivo NEX, Xiaomi Mi MIX 2S, Mi 8, Mi 6, OnePlus 7, 6T, 5, Pixel 3 XL, 2 XL, 2, Google Pixel 2 XL, Pixel 2", "What you get: DJI Osmo Mobile 3 (Built-in Battery), Power Cable, Storage Pouch, Wrist Strap, 4x Anti-Slip Pads, Osmo Grip Tripod, Osmo Carrying Case"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71UIfvVy3nL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71UIfvVy3nL._AC_SL1500_.jpg", "path": "full/250eada8f0478237e32fc5949df59c4ce9696801.jpg", "checksum": "292e829555ff8b01b6b924673917c7ac", "status": "downloaded"}]},
{"title": "VICSEED Car Phone Mount, [Thick Case & Big Phones Friendly] Long Arm Suction Cup Phone Holder for Car Dashboard Windshield Air Vent Hands Free Clip Cell Phone Holder Compatible with All Mobile Phones", "brand": "Visit the VICSEED Store", "rating": "4.5 out of 5 stars", "price": "$22.99", "colour": "not defined", "instock": false, "reviews": ["\n  I spent hours researching phone mounts. I have previous used a magnet mount and a air vent mount. I wanted something sturdy and adjustable. I like this one and placed one in my Lexus RX350 and one in our Tacoma. So far we are very pleased. If we have any issues in the near future I will update my review. I also like that this one has a 12 month warranty.", "Edit: updating my review after about three month. In response to what someone else said that the gray part bubbles in the heat- it may do this but it doesn’t damage and the bubbles go away. Not an issue at all. Both of my holders are standing strong. This is the best holder I could find and have ever used. I’m adding a photo to show how my husband did his sticking the suction cup only. REMEMBER TO THOROUGHLY CLEAN YOUR DASH FIRST.\n", "\n  This is the third one of these things I've ordered, trying to fit into the small vent of my Nissan Versa.  I ordered this because of the suction cup option but alas, my dashboard has NO flat surfaces to adhere to, the dash is all curves.  However, the vent clip fit perfectly into the small air conditioning vent and the thing is very sturdy, and holds my iPhone 8 plus with a fold over case just fine.  Adjusts great.  Finally, the right one.\n", "\n  It is very easy to install. Light, small and comfortable for my car (corolla). I am really delighted because I can put it on the windshield or on the dashboard and it is totally stable. I was worried that the cell phone would move from side to side or that it would fall off while it was driving, but the clip is firm and secure. It also comes with a small clip to put the phone on the air vent, so I can use it when I change cars. It was an excellent purchase, I totally recommend it.\n", "\n  By far, this is the best car phone holder I ever found after trying almost everything in the market. The extension feature and flexibility to reposition it is awesome! The suction and adhesiveness was not strong to hold a heavy phone on the dash board or windshield alone. I had to use suction on windshield and position the extended arm over the dashboard (se pic) to hold it safely without dropping from windshield. The front brackets could be redesigned to make it deeper and perhaps adjustable as well, with option to better grab and secure thick and heavy phones that use extra power battery (like mophie). The price is fair for the quality of the product. It is the most sturdy and reliable car phone holder to have, specially when driving over bumpy road. Highly recommended!\n", "\n  I have a Kia soul 2014 and the kia soul has a circle in the middle the stand worked perfectly for my car. Great buy.. it wasn't bulky or anything like that.\n", "\n  I really like this car mount. It latched to my dashboard immediately, and holds very strong - I can wiggle and readjust my phone without worrying of it falling. It looks simple and stylish, not too big and doesn’t obscure the view. Would definitely recommend it. Great product\n", "\n  I purchased this phone holder after having purchased a similar model the vendor sells.  Like the other model, this is extremely well built and NOT flimsy at all.  It allows you to position the phone in almost every position you can think of.  The holder has firm \"jaws\" that firmly but gently hold the phone in place.  You can easily charge your phone with the opening they provide at the bottom and easily remove the phone with the push of one button.  i have an iphone 5 with an otterbox case and it held the phone snugly.  The padded backing makes a nice secure fit on the phone.  I set up the phone on a weighted bean bag mount on my dashboard in order that I had free and clear site rather than put it on the window.  This is just a personal preference.  The suction mount holds nice and tight and I can adjust the position of the phone horizontally or vertically as needed for phone calls or GPS.  It is also handy when I receive calls, to simply put the call on speaker and use it as a hands free phone that is required on my state.\n", "\n  With the fact that nearly everything is made in China and cheaply designed, I was really expecting the worst with this. I've owned many mounts, some good and some not so good. I drive a lot for work, so I usually get to spend a good deal of money on my mobile phone mounts. This easily is one of the cheaper ones I've tried, which made me a bit concerned, but to my surprise it's easily one of the best mounts I've owned. This mount holds a an iPhone XR very well to the dash of a large SUV with worn suspension. My wife drives this SUV like she's auditioning for a role in Mad Max yet somehow this mount holds onto the phone and keeps it where it's supposed to be. This is above and beyond expectations.\n", "\n  Resultó de buena calidad y muy funcional\n", "\n  Holds my iPhone 11 very well\n", "\n  De qualité\n"], "description": ["3 in 1 Universal Car Mount: VICSEED car cell phone holder made with airliner PTFE material, can be universally mounted to your dashboard, windshield or vent to meet your demand at your convenience and requirements. Good choice to most of the cars, pickup trucks, SUV, trucks, taxis; good assistant for Uber, Lyft drivers.", "Perfect Protection: Say goodbye to the easy-scratched plastic panel car mount. VICSEED Upgrade 3 in 1 mobile phone holder for car adds a high-density silicone material with excellent resilience. The car phone holder is covered in a thick layer of silicone that will ensure your mobile device is safe from wear and tear. The unprecedented design makes leaves zero scratches on mobile devices.", "Secure Stable Install: The VICSEED car cell phone mount features an extra strong suction cup with super sticky gel pad. It easily sticks securely on the dashboard or most flat surfaces. Remove the car vent phone mount easily by pulling the suction pad without leaving any nasty marks. (Note: use warm water to wash the car holder's suction cup if the surfaces are dirty or it can not stick well, then let it air dry.)", "Long Arm Design & Multiple Viewing Angle: The car mount for iPhone 11 has a telescopic arm that extends from 4.84\" - 9.05\" and can pivot up or down for a variety of angles which optimizes viewing capabilities. This car holder for cell phone has a highly flexible ball-joint 360° rotation that provides infinite viewing angles. Position your phone at the perfect angle to enjoy a more relaxed and safer drive.", "One-Hand Operation: The car mobile phone holder also features a One-button release system that enables you to lock or release your phone with just one hand operation.Fit well for all mobile phones between 4''-7''in width and most thick case."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71JMJd7gafL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71JMJd7gafL._AC_SL1500_.jpg", "path": "full/e1140abefb2a676ba53fb342e549f1ebf1062bf6.jpg", "checksum": "4add276a900b5e31f05cca7a901f61e1", "status": "downloaded"}]},
{"title": "Mercury VesselView Mobile - Connected Boat Engine System for iOS and Android Devices", "brand": "Brand: MERCURY", "rating": "4.6 out of 5 stars", "price": "$221.40", "colour": "not defined", "instock": false, "reviews": ["\n  Unboxed this and had it linked up with the app in like 20 seconds.", "Infinitely less hassle, more accurate and more features than wired analog gauges, although I will have to put in some time on the water to check much of it out.", "...well that couldn’t wait. Got right out on the lake for a shakedown - this is terrific. Relatively intuitive app links up quickly and displays a basic set of engine and environmental information. Additional pages with editable fields allow you to set up engine specific or performance specific views.  Seriously cool details like holeshot and fuel consumption / remaining are easy to calculate as well.", "Heck, even the base map for the local lake I was on is better than the one in my Garmin Striker + 5!\n", "\n  This was soooo easy to install and the app works fine. I lifted off the engine cowl, located the Engine Management Computer. I unplugged the connector and plugged this Mercury VesselView inline and that was it. I needed to use a tie-rap (Zip-Tie) to keep it from flopping around loose inside the engine cover but that was it! I downloaded the app, turned on the key and started the app. It reached out and found the Mercury VesselView and linked to it easily.", "All done.\n", "\n  My new Tritoon came with only a speedometer.  I installed this in less than 5 minutes and now have Engine hours, oil and water pressure and and temperatures, speed, and more.  Also tells me when maintenance is due.\n", "\n  I'm giving this one star because you can't get fault information when you are in trouble. I was recently on Lake Powell for three weeks and had a fault. Lake Powell is remote and there is no cell coverage or wifi on much of it. Mercury appears to not care if you may ruin your engine because the stupid VesselView won't work untill you are off the Lake. Others have compained because  the fault code just said contact your dealer. Hard to do if you are someplace remote and counting on the motor. Additionally a 60hp bigfoot fourstroke doesn't report much continuously beyond engine hours and engine revs\n", "\n  I used this for my 24' pontoon boat or I didn't use it as it hardly worked.  I was no farther than 12' from the unit to my Bluetooth phone mounted on counsel. The signal kept on dropping. There was several times I needed to get info instantly from it and had to reconnect first, by that time it was to late. To make sure it wasn't my phone I downloaded the app on two other new devices. Another phone and a tablet with same results so I  know its not my equipment. Sure its super easy hook up but so what if its not dependable. I returned the item because it didn't work properly and they returned $133.86 out of $267.73. They claim it was missing items? it only has few paces what could be missing it comes with a small plastic cap for the harness, the unit, and 2 zip ties? Non of which cost 50% deduction of refund. Product is not dependable and the company is not trustworthy. Recommend staying with hard wiring your gauges until the technology improves. In emergency you need that data now not waiting to acquire a signal.\n", "\n  I tried to use the VesselView Mobile system with the Bluetooth interface.  It didn't work. Can you help me? When trying to CONNECT, it shows the engine I named in the found device list and shows something that looks like a mac address (88:6B:0F:DD:DE:DA).  When I select that device, it then shows \"Error Cannot complete initial setup\" after a short delay; the progress bar moves from about 12:00-3:00.", "My engine is a Merc 8.1S SmartCraft S/N:  0M026874.", "Can anyone help me please?\n", "\n  I recently purchased a boat with a Mercury engine. The new engine did not display my fuel consumption, fuel remaining and total hours like my previous boat. I never trust a marine fuel quantity gauge so I missed tracking my consumption. I installed a Vessel View system and linked it to my I-phone by Bluetooth. Now I have all the data I need and more. Installation on the engine was plug and play. Kudos to the engineers and programmers at Merc. Go to YouTube for installation videos.\n", "\n  This is a great device.  IMO all marine devices for boats 30' and down should be moving toward bluetooth.  It's not a true diagnostic device but it gives you accurate real time information that you need to keep an eye on how your engine is performing.  Much more accurate than analog gauges.\n", "\n  Installazione: semplice", "Attivazione: semplice", "Dà qualche informazione, ma l'app non è in grado di paragonarsi ad una strumentazione reale. Il problema più grosso è che ad ogni riaccensione di motore si riparte da zero. L'avevo comperato per avere sotto controllo i consumi visto che lo strumento del serbatoio è poco preciso, ma per il problema sopra esposto non si riesce ad avere informazioni semplici ed immediate.", "Manca completamente un manuale, si spera solo di avere presto aggiornamenti sostanziosi della App.", "Il potenziale esiste, ma Mercury deve lavorare, e molto!", "Installation: simple", "Activation: simple", "It gives some information, but the app cannot compare to  real instrumentation. The biggest problem is that at every engine start the app starts from scratch. I had bought the tool in order to keep track of fuel consumption as the tank gauge is unreliable.", "Unfortunately this tool does not help a lot  in order to supply simple and immediate information.", "There is no manual at all, we can only wait for App improvements, if any. Potential does exist, but Mercury has to work a lot on it.\n", "\n  Works only with outboards equipped with \"yellow\" termination connector.", "Mine is black so need to buy a yellow one.  Part # 859318T1", "Kicker is it's not available on Amazon or any Canadian websites. Whyyyyy???????\n", "\n  sehr hilfreiches Tool. Funktioniert sehr gut, bin noch auf der Suche nach einem Display welches auch bei Sonneneinstrahlung gut erkennbar ist. Endlich weiß ich wie es meinem Motor geht :-)\n", "\n  Delivered like a “Open box”. Device have many scratches. Looks like a previously used. I bought this for Christmas gift!\n", "\n  My boat didn't come with any instruments so this was an easy alternative to tell how my engine is performing. 2014 40hp 4-Stroke.\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "DIGITAL GAUGES ON YOUR PHONE OR TABLET - Keep track of your fuel usage, engine temperature, battery charge, RPM - or any other data points you want to see.", "PLUG-N-PLAY SETUP - Install in just a few minutes on any Mercury SmartCraft-capable engine: outboards and sterndrives, 2004 and newer, 40hp and up.", "CONNECTS WITH UP TO FOUR ENGINES - VesselView Mobile displays key data for up to four engines on your iOS or Android smartphone or tablet.", "KNOW WHAT'S GOING ON - Accurately monitor true engine running hours and know ahead of time when an engine is due for a regular maintenance interval.", "GO BOLDLY - Enjoy more time on the water with the peace of mind that VesselView Mobile is monitoring the engine using Bluetooth Low Energy technology."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81ccVp2LNGL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81ccVp2LNGL._AC_SL1500_.jpg", "path": "full/124ad20ce1f29225a13822629a66fe167dcd7f00.jpg", "checksum": "9c6939165d819b01394c42bc1266312b", "status": "downloaded"}]},
{"title": "Adjustable Cell Phone Stand, CreaDream Phone Stand, Cradle, Dock, Holder, Aluminum Desktop Stand Compatible with Phone Xs Max Xr 8 7 6 6s Plus SE Charging, Accessories Desk,All Mobile Phones-Black", "brand": "Brand: CreaDream", "rating": "4.7 out of 5 stars", "price": "$11.99", "colour": "Black", "instock": false, "reviews": ["\n  I wasn't sure if the stand would still work with the pop socket on the back of my phone, but it does. I love that I can lie in bed and watch videos without dropping my phone on my face when I fall asleep. I know it's not the intended use, but I flip the stand upside down and hook it on the shower door to hold my phone while I losten to music in the shower. I use the stand to follow along with makeup tutorials. It's so nice always having my phone at perfect viewing angle. Great deal, especially for the price!\n", "\n   I absolutely love this cellphone holder! The color is perfect , easy to store and travel with. I bought this because my cellphone kept sliding everywhere when I used it as an alarm clock now it’s raised and I’m a perfect spot! The cellphone holder also has great grips under the cellphone phone and at the bottom of the holder. My husband loved it so much I had to get him one as well !\n", "\n  I like this stand because of its versatility. I use it in the kitchen when I’m cooking to read recipes from my phone, at the kitchen table for reading and navigation with one hand (while eating), for my toddler and infant to watch videos at the table together. My iPhone 8 Plus fits perfectly with the Otterbox case I have. The stand can be adjusted for the phone to be completely upright or level. I like that it keeps my neck from hurting because I don’t have to look down while reading. It even works on my couch and other furniture. There are grippers in the bottom to keep it from sliding around while I’m trying to use my phone. You can easily charge it while it’s on the stand as well. The pictures are of my daughters phone on the stand.\n", "\n  This stand fits my iPhone XS Max with the case on.  I like being able to adjust the tilt.  Gave it 4 stars because it would be nice if the manufacturer had made the stand higher in the back so larger phones won't tip over.  I'm able to adjust the stand more forward so my iPhone won't cause the stand to fall over backward.  I'm able to read/scroll while the phone's on the stand, but trying to text wouldn't work (it's much easier to text with both hands holding the phone.  Smaller phones might work better, but this works for my needs, and the price was great.\n", "\n  Oh my, this is a WINNER! I saw an ad on TV for a different holder, but when I looked online it was quite expensive My search turned up this one, and a few others, so I read lots of reviews for holders that looked similar.  This one was a home run!", "First, it's very sturdy and stylish. The metal is thick but not heavy. The hinge is high quality and the little hooks that form a tray for the phone to rest are wide enough to hold my phone in its OtterBox! It's lightweight but heavy enough to stand easily on its own. I'm definitely going to buy another one, because it can hold a tablet as well!", "There is only one fact that may be of interest: in my opinion it is not rose gold - it is pink metallic. I am not a fan of rose gold, so this was a very happy surprise for me. I love the color, and it complements other colors better than I feel rose gold would. I'm so glad I purchased this one!\n", "\n  We have several of these and will be buying more!  So sturdy and well put together.  Have these at home and at work and have even started buying them as gifts!  Other ones are plastic or aren't big enough to hold larger phones with cases but we have no problem with ours (we have iphone 8 plus in cases) and have no issues.  Can't recommend this enough!!\n", "\n  I take a lot of aerial classes and love recording what I do. Sometimes I'll ask a friend or someone in the class to help me record. Other times, I'll use a yoga block or a water bottle and have my phone lean against it for recording. I decided that it was time for me to get a phone stand. I picked this product because it was rose gold colored and adjustable. There's a nice tension in adjusting the angle of the phone stand. It fits my phone with a case on. It's durable and is serving its purpose. So far I have no issues with it.\n", "\n  I ordered this for my desk at work. I have a lot of stuff already on my desk so I didn't want anything too big or bulky, and I have to say it outmatched my expectations! I have a heavy duty front and back phone case, with a popsocket on the back and it fits perfectly! This is such a great gadget and I will definitely be purchasing one for my home as well!\n", "\n  Good quality, solid build.\n"], "description": ["Special Design: MULTI-ANGLE design make cell phone stand possible to be adjusted to your desired angle (270 degree). And compared with other phone stands, the hook of our stands have been widened in order to fit well with the devices in protect case.", "Universal Compatibility: Stand for cell phone work with all 4 - 10-Inch smartphones and e-readers, iPhone 11 Max Pro/ 11 Max/ 11/ Xs Max/ Xs/ XR/ X/ 8 7 6 6s Plus 5 5s SE , Galaxy S9 /S9 Plus/S8 / S7 / S6 / Note9/Note 8, LG, Huawei,LG,IPAD mini, Samsung Tab, Google Nexus, Kindle and so on.", "Sturdy Construction & Rubbers Pads: Durable aluminum body, with a sturdy construction, can hold your phone steadily. Rubber pads and feet protect your device from scratches and sliding.", "Smart Lifestyle: Hands-free, make it possible to play games, use Facetime and Youtube while charging. Play a good role in your office, kitchen, nightstand, dining table.", "Excellence on details: Similar CNC technology as Macbook adopts, you could enjoy the comfortable sense of touch even on the edge"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71nlkHT7zUL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71nlkHT7zUL._AC_SL1500_.jpg", "path": "full/8835b99eb81cd9c704f93f638a45d364df1ad191.jpg", "checksum": "371b35a763397ae2dc0df945fc17cc71", "status": "downloaded"}]},
{"title": "DJI OM 4 - Handheld 3-Axis Smartphone Gimbal Stabilizer with Grip Tripod Vlog YouTube Live Video for iPhone Android", "brand": "Visit the DJI Store", "rating": "4.6 out of 5 stars", "price": "$149.00", "colour": "not defined", "instock": false, "reviews": ["\n   I love this thing--super awesome app, buttery smooth footage, and works wonderfully with my iphone.", "However I got it for one key feature: they claim (unless they removed it) \"works with external lenses.\"", "It does not.", "I got the most popular wide angle lens (only 3oz) and the gimbal motors couldn't handle it.", "I really wanted to love this thing, but I'm afraid it just works if you are using your phone, which my guess is 95% of people out there. So it'll probably work for you!", "But I wish they'd correct the promised features.  I sadly had to return mine.", "Hope this helps!\n", "\n  Overall, smaller than the Osmo Mobile 3, 2, and 1. I'm upgrading from the Osmo Mobile 2. Off the bat the grip is more sensitive. The buttons are all still there, but the functions are assigned quite differently. Standby mode (introduced in Mobile 3) is a cool improvement.", "Gesture control is very neat. I looked like a Japanese schoolgirl while doing it, but it was effective and started tracking my face a second or two after I did the gesture, turning on a three-second delay to start recording.", "The Mimo app is definitely an improvement over \"DJI GO 4\". Mimo connects directly with the Photos app in iPhone, so you don't have to go through an app to access your photos/videos.", "There's two things stopping me from giving this five stars though:", "1. The magnetic clamp ironically, is the biggest downgrade of the new model. The ability to add heavier phones to the gimbal comes with a cost - it is noticeably less secure than the previous models. If you have a case, your phone will fall off the magnetically attached clamp (the one you attach to the gimbal) with any willful thrust or whip. This is why DJI offers magnets you can attach to your naked, un-cased phone. I haven't used them yet, but I'm sure that's why they offer both options.", "I also had some issues when panning an active target. The active target tracking requires excellent light and not too rapid movement from the subject and operator. As with the previous models, it will get lost easily in poor lighting.\n", "\n  I got this gimble hoping it will support my note 20 ultra. Let me start by this, all the android user should go for this gimble. It support the weight of my phone without a sweat and has most of the options unlike the zhiyun smooth 4. Thought the dji mimo app is not having the support for 4k 60 fps but you can always use you phone camera app to use it and will work like a charm. This gimble is having a magnetic mount and its really really strong. This is the best gimble and best investment.", "Its supports a weight of 230 gms and +/-60 gm which makes a total load it can handle to 290gms. I use this gimble with the note ultra with a pretty sturdy case and the gimble doesn't seem to have any problem.\n", "\n  I was recently using the OM 3 and picked up 4 after seeing that it doesn't require balancing (this is easily the biggest pain when using gimbals) and I'm super happy with it. It's lighter then the 3, motors are significantly faster and yes it takes a fraction of the time to pull out and setup. Plus it's basically that same price as the 3 was before the 4 came out (when you consider it comes with the tripod and is equal to that package for the 3).", "For most people I wouldn't recommend upgrading from the 3 to the 4 as it's more of an evolutionary step then a revolutionary change. But if you're considering one over the other, go with the 4, it's worth the extra amount even though they dropped the price of the 3 to around $100 at the time of this review.\n", "\n  This is great Phone Stand, articulate Arm. Very advanced feature. Can hold phone long time\n", "\n  First gimbal, first was off brand and app didn’t work well so I went with a name brand and to my discovery this was good timing with a new release.", "Purchased the day it came out, however osmo wants you to permanently attach the magnetic ring to the back of your phone. Gonna order a slim case to switch out when using the gimbal. Slight inconvenience but I’ll be back to edit to see if it works.", "Edit: my misunderstanding. No case needed for the magnet to work. It’s optional.\n", "\n  This things is solid! It’s paired flawlessly and works amazingly well with my iPhone XS Max! I was worried it couldn’t handle the size/weight, but it’s like it’s holding nothing. The magnetic connection is life changing from the previous setup. Easy on, and doesn’t come off unless you really pull it off hard. I love it 5/5\n", "\n  This is my 4th attempt with a phone gimbal and this the one! The magnetic clip makes it easy to install. No need to worry about balancing anymore.", "The app is intuitive and explains all features. I use an iphone 6.\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "【FEEL THE PULL】: The magnetic phone clamp and magnetic ring holder enable effortless capture whenever inspiration strikes. Attach your smartphone to DJI OM 4 instantly, perfect for filming on the go.", "【3-AXIS STABILIZATION】: Never post a shaky video again. Even with an external lens added, DJI OM 4’s powerful 3-axis motor keeps your smartphone steady and your video smooth.", "【DYNAMICZOOM】: Try out the mind-boggling “Hitchcock effect,” a creative zoom shot that delivers a Hollywood feel with minimal effort. Advanced algorithms know what to do, so all you have to do is tap and walk.", "【GESTURE CONTROL】: Whether you’re taking a selfie or a group photo, hands-free is the way to go. Remotely control OM 4 with just a gesture. Snapping a pic or starting a video has never been this convenient.", "【ACTIVETRACK 3.0】: ActiveTrack 3.0 makes following subjects a walk in the park. This version recognizes adults, children, and pets with higher accuracy, and you can even fine-tune your image composition with the joystick.", "【WHAT YOU GET】: DJI OM4 x 1, Magnetic Ring Holder × 1, Magnetic Phone Clamp × 1, Grip Tripod × 1, Power Cable × 1, Osmo Storage Pouch × 1, Wrist Strap × 1, Manuals × 1", "【COMPATIBLE WITH MOST SMARTPHONES】: DJI Mimo App requires iOS 10.0, Android 7.0 or above. Compatible devices include: iPhone 11, 11 Pro, 11 Pro Max, XS, XS Max, SE2, XR, X, 8 Plus, 8, 7 Plus, 7, Samsung Galaxy S20 Ultra, S20+, S20, S10+, S10, S9+, S8, Note 10+, Note 9, A50s, HUAWEI Mate 30 Pro, Mate 30, Mate 20 Pro, Mate 20, Mate 10, Mate 9, P40 Pro, P40, P30 Pro, P30, P20 Pro, P20, Nova 5, HONOR 30 Pro, 30, 20 Pro, 20, 8X, Xiaomi Mi CC9 Pro, Mi 10 Pro, Mi 10, Mi 9, Mi 8, Mix 2S, Mix 2, OnePlus 8 Pro, 8, Google Pixel 4XL, Pixel 4, realme X2."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71yauPbL7KL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71yauPbL7KL._AC_SL1500_.jpg", "path": "full/26b0624ba63de3d8525361fbe8fdc280ae9c5ee1.jpg", "checksum": "b3ed945546fc2514ca7a74f6778e25cb", "status": "downloaded"}]},
{"title": "OMOTON C3 Cell Phone Stand for Desk, Larger and Exceptionally Stable, Adjustable Phone Cradle Holder with Bigger Body & Longer Arm, Compatible with iPhone, Tablets (7-10\") and More,Black", "brand": "Brand: OMOTON", "rating": "4.9 out of 5 stars", "price": "$11.99", "colour": "Black", "instock": false, "reviews": ["\n   Excellent phone stand, high quality aluminum and very sturdy, keeps your phone or tablet in place and with rubber to protect your phone, highly recommended\n", "\n   for your desk or night stand!\n", "\n  Had these for about 3 months now and they work great.  One thing to note:  the two arms on the bottom tend to block the microphone when on speakerphone.  You can offset the phone to one side.  In my situation, I have an apple iphone case that has a flap which i use to hold the phone and it free floats on top of the arms.  The adjustable hinge has not loosened or gotten any different as we use it.  Very strong, and the depth of the arms is sufficient for iphones even with leather cases (an otterbox probably wouldn't fit), but it can still act like a \"table\" if you tilt it back.  I'd buy again!\n", "\n  I've ordered several of these stands and have them scattered throughout my home.  With phone on the stand next to the bed, don't have to pick up phone to see what that latest notification was.  On the kitchen counter, can adjust the angle to easily see a recipe on the phone, no touching the phone with wet or sticky fingers; and if something gets spilled, the phone is above and away from the wet surface.  The adjustable angle is a great feature, and it securely holds whatever position I've set.  Have used these as stocking stuffers and know that the recipients have enjoyed them as well.  I'm sure I'll be buying more!\n", "\n  The stand seems well made and durable.  The adjustment hinge is not too hard to turn, and it stays in place once adjusted. The rose gold color matches my iPhone.  You can kind of see this in the third picture. There is padding on the bottom of the stand to protect furniture and to keep the stand from sluding when engaging with the phone. There is also padding in the two cradling arms. The cradling arms are long enough to accommodate a phone in a case, even a larger case.  The opening for cables is easily accessible and helps keep the charging cable controlled while charging the phone.", "Regarding the size: it’s a good size for a phone in either orientation.  The phone feels secure and stable whether I have it sitting in landscape or portrait orientation.", "It’s only been two days, but so far I am happy with this purchase, and I feel it’s a good product. It looks nicer than I expected for the money. If I find that it’s not living up to my early assessment, I will update my review accordingly.", "Update, 12/11/2018:  I am still very happy with the stand. It is holding up well and still looks good. Padding has remained intact.  I recently ended up purchasing another for use downstairs.  These are good little stands.", "Update, 11/20/2020.  It’s been a little over two years since I purchased two of these stands.  Both get used quite a bit every day.  Both are holding up, still looking and functioning like new.  Even the padding has remained fully intact.  My current phone has FaceID, and keeping the phone on the stand, rather than flat on my desk, while working makes using FaceID that much more seamless.  I continue to enjoy and recommend these stands.\n", "\n  There's a reason that this product has an average of 5-Stars in 147 reviews (as of today).  It is simply a very well made stand that includes an adjustable holder (which was smart \"user\" thinking).  I got the silver color, it looks great and has a soft satin finish.  The anti-skid pads they include do a fantastic job of holding the whole thing and the phone in place.  The stand itself is all metal with some heft before you add the phone.  I've cobbled a few of my own home-made phone stands over the years.  Had I known about this one, I'd of bought it in a heartbeat and declared victory.  Don't look any further if you have wanted a stand that allows your phone to comfortably sit either vertically or horizontally on your desk.  I can't say enough about how well designed and crafted this product is and the price is well...just \"icing on the cake\".\n", "\n  Edited to add: I have liked mine so much that I now ordered one as a gift for my daughter. The packaging on the second wasn’t quite as nice, but the stand seems identical and arrived in good condition.", "ETA one more time: the more I think about it, the less happy I am with the change in packaging. The first one came in a sturdy, aesthetically pleasing corrugated cardboard box that protected the product well, used no plastic and would have been suitable for a corporate gift. The second came in a flimsy light cardboard (like tag board) box, and inside the stand was wrapped in an oddly rubbery feeling bag.  I’m not taking off stars for this, but it’s disappointing.", "****************************", "My cell phone stand arrived today, and I am really impressed. It seems very solid and stable and looks nice, very simple and functional (I got the rose gold finish). It holds my iPhone 8 and also works for my iPad Mini and feels like both sit securely in it. I even like that the packaging was corrugated cardboard rather than plastic (much better for the environment). I may have to buy one for my husband for his birthday (if he doesn't order one for himself first).", "If any flaws or failures show up later I will come back and revise, but for now I would happily give this six or seven stars (and no, this is not part of a promotion-yes, I paid for this in full with my own money).\n", "\n  This item did not fit the iphone11. Would prefer to send it back. Very disappointed.\n", "\n  I bought the stand for my wife and she loves it. It is really well-made and perfect for her iPhone 6 S plus. Great quality and highly recommended\n", "\n  Its just says what it does.  I can't think of anything bad about it.\n", "\n  The cradle is excellent. Good quality and very sturdy. Exactly what I wanted.\n", "\n  Preso quasi per gioco... Invece molto utile! Buone le parti gommate che rendono stabile sia il supporto che il cellulare posto all'interno di esso. Avevo paura che fosse piccolo per il Samsung A71 invece fa molto bene il suo lavoro!", "Aggiungo che trovandomi bene con il primo - dopo qualche giorno - ne ho preso un altro, quello ROSA per me. Bellissimo! Oltre che funzionale é molto femminile. Il colore é molto più bello che in foto. L'ho adoperato anche in cucina per leggere la ricetta mentre cucinavo! 😉 Venditore ed Amazon voto 10!\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "Adjustable: Viewing angles could be adjusted to meet different needs. Keep your hands free during games, videos and Facetime.", "Sturdy Construction: Thick (3mm) aluminum material is strong enough, will never wobbling when sitting your cellphone on. Sleek design ensures comfortable hand feel.", "Cable Management: Hole opening especially made for charging cable enables you charge device while using this stand, keeps desktop neat.", "Anti- Scratch & Anti- Slippery: Silicone soft pads prevents the bottom and back of your device from scratching and scuffs, and also providing a sturdy foundation with superior stability.", "Wide Compatible: The hook is wide enough to hold cellphones of any size, even with a HEAVY CASE on."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61uxrRPDNEL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61uxrRPDNEL._AC_SL1500_.jpg", "path": "full/e503ab20189f22e3a3fd5dc7b8cf2a6770ceae6d.jpg", "checksum": "10d5530ca55de2a19d3e70d1d6ca263b", "status": "downloaded"}]},
{"title": "BLU Studio Mini -5.5HD Smartphone, 32GB+2GB Ram -Black", "brand": "Visit the BLU Store", "rating": "4.0 out of 5 stars", "price": "$69.99", "colour": "not defined", "instock": false, "reviews": ["\n  I honestly don't know why these aren't more popular. Let's be real here, this is a very, very good \"economy\" phone that rivals midgrade phones. Sure your higher end phones have metal casings, water resistance/proof, fingerprint scanner, but for those that can do without it's a crazy good steal. Seriously. $65. Brand new. Unlocked. You can't beat it. Even the low $100 models aren't even better, spec wise. It comes with a case and screen protector, which is easily a $20 value.  Case in point, these are great for basic employee/kid/elderly phones. You can buy 15 of these for the same amount as any new $1000 phone, not be locked to a carrier, and don't sweat it if you lose it or it gets stolen. I wish they had aftermarket cases though, ha.\n", "\n  I have always used budget phones and the last Blu phone I had was the HD R1 that lasted over 16 months as my Daily phone till I dropped it the wrong way, with a case, and shattered the screen. I got an email from Blu about this model and was intrigued by the features and spec.  All of Blu’s other lower end phones suck because of their specs but this one would fit the bill. I got this phone for my 9 year old son. Unfortunately he’s still in the learning stages of how to be responsible for things and broke the last Older iPhone we gave him while roller skating outside. I call this type of phone a disposable phone cause of the cost. if it breaks, it was only $60, replace it with another.  Build quality is pretty good, the 3000mah battery life is awesome and lasts for days.  My son has Roblox and a few games on it, he doesn’t complain that it’s slow. We also added a parent link app to where we control his screen time which is cool.  Remember the price people !!  Don’t give a bad review trying to compare this to a flagship phone cause it’s not !! Some complain about not having a selection of cases, duh !! It’s Blu and even other small name brand companies do NOT offer a case but be lucky Blu gives you a free one in the box with the phone !! For now it’s working well. I may just buy a couple more and have them in inventory cause they are so cheap and if one breaks, replace it. Thanks Blu for making a great replacement for the HD R1. It’s a good design with good specs.\n", "\n  Someone explain why in hell I bought a phone that I absolutely cannot find a case to buy for it?! BLU, when you go to their freaking website, and click \"SHOP\" brings you smack dab right back here to amazon! Yet AMAZON FREAKING SEARCH does NOT have a single case for a phone THEY SELL! There is NO MODEL NUMBER to reference! Just \"Studio Mini 5.5\" but NOTHING AT ALL MATCHES when you search for a BLU Studio Mini Case! NOTHING! NOT the camera hole, NOT the power button hole, NOT the volume button hole. ABSOLUTELY NOTHING AT ALL! You're trying the tell me THERE'S ABSOLUTELY NO DAMN CASE WHATSOEVER other than what came in the damn box?! If you want to protect your phone DON'T BUY THIS ONE! SO DISGUSTED!\n", "\n  After getting the phone and going to my provider for a nano sim....  You must run the android update to get all of the features.  My phone would not allow ringtone, alarm, or notification changes until after the update completed.  Other than that it's a BLU phone.  It's fast enough to get the job done, relatively good reception in the house and 5 bars out side as 4G LTE.  Wifi seems a bit intermittent, but the update may have fixed that too.  It's a great replacement for my dead BLU Studio X+ I've had for years.\n", "\n  I got this phone for my 12 year old daughter and wanted something basic without it costing a lot. It was easy to set up and even arrived with a 60% battery charge. I was happy that it came with a screen protector and a clear case because the one I ordered did not fit. The only reason I gave it 4 stars is because I can’t seem to find another case!", "Update March 29th 2020: This phone was sent in because it stopped charging. Got it back and it’s still taking 13+ hours to charge, if it charges at all. Customer service was great. I will not be buying this phone again though!\n", "\n  Packaging was good and all parts came in. Phone turns on right away and it’s nice and bright everything seems to work accordingly.", "Phone comes with silicon protector.", "Screen protector came broken.\n", "\n  I really liked how it was such a good deal for the price. It is a very good replacement phone for me and possibly you\n", "\n  very nice design. Phone feels quite sturdy. I always buy BLU studios so i watch TV or so. this phone is amazing. My wife is quite happy with her gift. Lots of internal space and easy user interface. Very easy to set up. Open to all networks(unlocked phone) My wife is enjoying games on it right now!! haha\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "5.5”Hd+ 18:9 Curved Glass Display 720x1440 Resolution.", "13MP Main Camera with LED Flash, 8MP Selfie camera with LED Flash.", "32GB Internal memory 2GB RAM Micro SD up to 64GB; Octa-Core 1.6GHz processor with ARM Cortex-A55 chipset.", "3,000mAh Battery and Android 9 Pie.", "4G LTE (2/4/5/12/17) 3G: (850/1700/1900): US compatibility Nationwide on all GSM Networks including AT&T, T-Mobile, Cricket, Metro PCS, and others. Not compatible with CDMA Networks like Verizon, Sprint and Boost Mobile."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/A1gUduSRYZL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/A1gUduSRYZL._AC_SL1500_.jpg", "path": "full/443f81360ac22f95ccfb9ba1cbbae46aad05ac05.jpg", "checksum": "d75ccafd0cc291fb65a40c65a623f8b5", "status": "downloaded"}]},
{"title": "Samsung Galaxy A01 (A015M) 32GB, Dual SIM, GSM Unlocked, 5.7” Display Smartphone - International Version - Red", "brand": "Visit the SAMSUNG Store", "rating": "4.5 out of 5 stars", "price": "$124.97", "colour": "not defined", "instock": false, "reviews": ["\n  Very good, only issue would be battery life; is not nearly as long as most devices.\n", "\n  Beautiful, reliable phone for the price! Delivery was on time and packaging was brand new!\n", "\n  Muy bueno me encanto\n", "\n  We bought this for our son and wasnt sure after reading the reviews how it was gonna be but it's been perfect ! No problems with selecting English for the language and the graphics are amazing. Works perfectly\n", "\n  Screen must be lit for call sound to be clear. As soon as screen goes to sleep, call is distorted. Same thing if gps is running. I make long drives, if a call comes while gps is on I can't hear the other person. Terrible!\n", "\n  Me gusto solo que en la página decían qu uno de los teléfonos era para doble SIM y no fue asi\n"], "description": ["International Model - No Warranty in US. Compatible with Most GSM Carriers like T-Mobile, AT&T, MetroPCS, etc. Will NOT work with CDMA Carriers Such as Verizon, Sprint, Boost", "5.7\" (145.1mm), 720 x 1520 (HD+), PLS TFT LCD, Color Depth (Main Display) - 16M, Android 10.0; One UI 2, Face Unlock", "RAM - 2GB, ROM - 32GB, Qualcomm SDM439 Snapdragon 439 (12 nm), Octa-core (4x1.95 GHz Cortex-A53 & 4x1.45 GHz Cortex A53)", "Dual Rear Camera - 13.0 MP + 2.0 MP, Rear Camera Zoom - Digital Zoom up to 8x, Front Camera - 5.0 MP, 3000 mAh battery", "3G HSDPA 850 / 900 / 1700(AWS) / 1900 / 2100, 4G LTE band 1(2100), 2(1900), 3(1800), 5(850), 7(2600), 8(900), 20(800), 28(700), 34(2000), 38(2600), 39(1900), 40(2300), 41(2500)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71valQo5u5L._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71valQo5u5L._AC_SL1500_.jpg", "path": "full/3bd0abfcf4834fc41705f14f5511545c9bb22436.jpg", "checksum": "79bd9301d5542edb81523227659abc0c", "status": "downloaded"}]},
{"title": "Nokia 2.4 Android 10 Unlocked Smartphone with 2/32 GB Memory, 6.5-Inch HD+ Screen, 2-Day Battery Life, Fingerprint Sensor and Google Assistant, Charcoal (AT&T/T-Mobile/Cricket/Tracfone/Simple Mobile)", "brand": "Visit the Nokia Store", "rating": "4.1 out of 5 stars", "price": "$139.00", "colour": "not defined", "instock": false, "reviews": ["\n  Great value. The Nokia has a great screen, battery life, and provides 2 years of Android OS updates (from date of release). It also comes with TPU case which is great because 2.4 cases can be hard to find. Not a lot of bloat ware which is good because the phone only come with 32GB out of the box (2GB of RAM). I immediately added 64GB via a microSD card. Fingerprint reader on the back is convenient but you must place your finger carefully to avoid multiple reads. Some software like Outlook and Teams don’t load as quickly as the usual suspects do but that may be because the are running in a Work profile. I was considering a factory unlocked phone from Motorola but like the design, value, and build quality of this new phone from Nokia.\n", "\n  The product is worth every penny.\n", "\n  Previous phone was a Nokia 2.2.  This is essentially the same phone only better.  I liked the 2.2 so this one is also good.  (My son has the 2.4, his mother and I have 2.2 phones.)\n", "\n  Latest Android sucks without back button, phone lags quite a lot\n", "\n  It's an excellent phone with a beautiful shape, a good camera and a fantastic price.\n", "\n  The phone has a hard time playing games like Pokémon Go. Has a lot of drag just using most apps. No fast charge or wireless for this price point either.\n", "\n  Not a good phone, the performance is very bad and it gets frozen all the time even when using applications like Google navigator.\n", "\n  Brought for a Christmas gift for my wife\n"], "description": ["Capture detailed shots on the Nokia 2.4 Android Smartphone after dark with its Night Mode advanced image fusion and exposure stacking.", "Put your best face forward with Portrait Mode's custom shapes and blurred backgrounds, plus the phone features a new Portrait editor.", "Charge less and get up to 2 days on a single charge with the 4500mAh AI-assisted Adaptive Battery.", "Your phone is ready for Android 11 and beyond. Get the latest features with three years of monthly security updates and two years of software upgrades.", "Unlock your device quickly and easily with the convenient fingerprint sensor. Includes phone, charger, cable, and quick start guide."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61sLvszoETL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61sLvszoETL._AC_SL1500_.jpg", "path": "full/eed331784937252204bfd6504f0005fdb63824df.jpg", "checksum": "7a44c0db1a6024eef179aa5cd48b53f2", "status": "downloaded"}]},
{"title": "KODAK Step Wireless Mobile Photo Mini Printer (White) Compatible w/ iOS & Android, NFC & Bluetooth Devices", "brand": "Visit the Zink Store", "rating": "4.7 out of 5 stars", "price": "$59.99", "colour": "White", "instock": false, "reviews": ["\n  This is a cool little printer, and small it is.  The general idea seems to be a carry with you printer that'll print these smallish 2x3 printer that have adhesive back and can then be put on the back of your phone, a board, and such.", "Idea is great, and for the most part it succeeds in its mission.  It unfortunately misses in its most important part, faithful reproduction of the picture.  I skews the color profile, making it way too warm, to the point of it becoming unpleasant.", "If this was the only option out there, it'd be great, but it isn't.  Funny thing is that Kodak makes a small 2x3 size camera with built-in printer that does a significantly better job, for only a few dollars more.  It is even a 4-pass dye-sub printer that gives much better results.  Not obvious why they chose not to do just the printer part of that solution here.", "In short, look elsewhere.\n", "\n  Not compatible with Android galaxy devices.  The Bluetooth detects it and connects but the does not stay connected to it like a Speaker or Headphones does.  I could only get this to work with my iPad none of my phones would work I tried Galaxy s9 galaxy S10 and galaxy s20..  none worked.\n", "\n  Super easy to use\n", "\n  Just got my kodak step in the mail and couldn't wait to try it out. Set up was a sinch and it synced to my phone in no time flat. Prints came out beautiful and quick. So happy I have my own printer, now i can print photos whenever I feel like instead of driving to the store. Total printing freedom.\n", "\n  Everything's connected, but the app wont even detect that I have a printer. Wtf\n", "\n  I have had this product for a few days now and have tried it a couple times.  It's hit or miss though.  Set up is fairly easy. It needed to be charged out of the box which was a little anticlimactic. But what made me put a review was the fact the printing itself. I tried to print this photo of my kids and what came out was an extremely zoomed in photo that didn't even print the actual subjects. I had to do it a second time and choose a different image because I was afraid of wasting my photo paper. Which is annoying because it's not like this thing just uses regular paper 🙄 . Might update this review if customer service reaches out or if I figure it out. Otherwise, just a heads up.  Choose an image that has the subject dead center and is already in the orientation that you want to print in, portrait, choose a portrait image. Landscape, choose a landscape image.\n", "\n  What's great about this printer is that is so light and small you can take it anywhere you need. On the road, on a trainride, wherever you feel like printing. Also, it has a long battery life so you don't always have to be connected to power to get the job done.\n", "\n  Got this for my daughter for her birthday and it works great! The picture quality was awesome. The pictures didnt come out with a grainy look like u get from some printers! Definitely recommend!\n", "\n  Brilliant print and fast easy set up. Comes with only 5 pieces to print so order the paper at the same time\n", "\n  This is a cute printer, and although as others have mentioned the images are too \"warm\", they look very like the Polaroid photos of the 80's and I quite liked the look of them. Takes about a minute to print an image, but the results are great with a good novelty factor.", "However, the Kodak app is clunky and buggy and annoyingly the printer wouldn't accept Polaroid 2x3 ZINC photo paper. Seems to only like it's own brand, which is irritating. The work-around solution was to use the blue calibration sheet from the Kodak ZINC paper with the Polaroid ZINC paper and that make the printer accept the obviously compatible Polaroid ZINC paper, but really, should you have to do this?\n", "\n  This is a present for Christmas, so not sure on the workings on this, but it arrived quickly and well packaged. From the reviews I’m excited to see how great it works.\n", "\n  Great little compact printer. Simple to use. Images come out well, not as colour perfect as a standard 6 x 4 photo but definitely not bad at all. Has almost a vintage Polaroid look to them which for a small photo album for the future adds a bit of charm. Got a small album to house them in, was a great xmas gift.\n", "\n  Its a fab little printer, it is only compatible with Kodak zink paper though and not others so I'm going to keep the calibration sheet (blue one) and try polaroid zink paper, if it works it will be handy as the polaroid ones are easier to get hold of, if it doesn't I have a camera the polaroid ones work in so no drama lol\n"], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "STEP UP YOUR PRINTING GAME: No more making plans to print tomorrow. Kodak step printer connects to any iOS or Android Smartphone, Tablet or Similar Device [Via Bluetooth or NFC] so you can print pics instantly; Turn your selfies, portraits, social media posts & other images into physical photos", "AMAZING ZERO-INK TECHNOLOGY: Zink innovation eliminates the need for pricy ink cartridges, toners or ribbons; 2” x 3” sticky-back paper with embedded dye crystals delivers high-quality, durable, affordable, beautifully detailed prints that are resistant to moisture, rips, tears & smudges", "FULL EDITING SUITE VIA APP: Download the free Kodak App to create collages & customize your snaps with stunning filters, interesting borders, cool stickers, funny text & other personalized flair; Edit photos in your camera roll, then send to step for instant printing in less than 60 seconds", "TAKE YOUR PROJECTS TO GO: Skip the computer connections, messy wires & clunky equipment; Our palm-sized printer weighs less than a pound, sets up fast & delivers gorgeous prints you can peel & stick everywhere; Great for decorating a fridge, laptop, locker, scrapbook, notebook & more", "CUTE, COMPACT & COLORFUL: Step printer is designed for photo-loving influencers & crafters of all ages & skill levels; Portable, lightweight device features built-in lithium-ion rechargeable battery Prints 25 photo on a full charge:; Available in a variety of colors—a fantastic anytime gift idea", "Max prints peed black white: 1.0 pages per minute", "Max print speed color: 1.0 pages per minute", "Printer technology: Zink technology"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81lAHBOPTnL._AC_SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81lAHBOPTnL._AC_SL1500_.jpg", "path": "full/20d0393d29932d3b8237250fde247dae4d7bac56.jpg", "checksum": "19271e8449ee2063bfb8f0f0d0257f71", "status": "downloaded"}]}
]